Revit.AnalysisDisplay.VectorAnalysisDisplay.#ctor(Autodesk.Revit.DB.View,System.Collections.Generic.IEnumerable{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IEnumerable{Autodesk.Revit.DB.XYZ})
Create a Point Analysis Display in the current view
view:
sampleLocations:
samples:

Revit.AnalysisDisplay.VectorAnalysisDisplay.InternalSetSpatialFieldValues(System.Collections.Generic.IEnumerable{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IEnumerable{Autodesk.Revit.DB.XYZ})
Set the spatial field values for the current spatial field primitive.  The two
input sequences should be of the same length.
sampleLocations:
samples:

Revit.AnalysisDisplay.VectorAnalysisDisplay.ByViewPointsAndVectorValues(Revit.Elements.Views.View,Autodesk.DesignScript.Geometry.Point[],Autodesk.DesignScript.Geometry.Vector[])
Show a colored Vector Analysis Display in the Revit view
view:
samplePoints:
samples:
Returns: